genre(xроники_Черного_Отряда,0).
genre(властели_Колец,0).
genre(игра_престолов,0).
genre(имя_ветра,0).
genre(принц_Терний,0).

genre(нейромант,1).
genre(контакт,1).
genre(мечтают_ли_андроиды_об_электроовцаx,1).
genre(космическая_одиссея,1).
genre(игра_Эндера,1).

genre(убийство_на_улице_Морг,2).
genre(приключения_Шерлока_Холмса,2).
genre(снеговик,2).
genre(хладнокровное_убийство,2).
genre(исчезнувшая,2).

genre(оно,3).
genre(дракула_Брэма,3).
genre(сборник_лучших_произведений_Г_Ф_Лавкрафта,3).
genre(призрак_дома_на_холме,3).
genre(изгоняющий_дьявола,3).

country(хроники_Черного_Отряда,0).
country(властели_Колец,1).
country(игра_престолов,0).
country(имя_ветра,0).
country(принц_Терний,1).

country(нейромант,0).
country(мечтают_ли_андроиды_об_электроовцаx,0).
country(космическая_одиссея,1).
country(игра_Эндера,0).
country(контакт,0).

country(убийство_на_улице_Морг,0).
country(приключения_Шерлока_Холмса,1).
country(снеговик,2).
country(хладнокровное_убийство,0).
country(исчезнувшая,0).

country(оно,0).
country(дракула_Брэма,1).
country(сборник_лучших_произведений_Г_Ф_Лавкрафта,0).
country(призрак_дома_на_холме,0).
country(изгоняющий_дьявола,0).

seria(хроники_Черного_Отряда,1).
seria(властели_Колец,1).
seria(игра_престолов,1).
seria(имя_ветра,1).
seria(принц_Терний,1).

seria(нейромант,0).
seria(мечтают_ли_андроиды_об_электроовцаx,0).
seria(космическая_одиссея,0).
seria(игра_Эндера,1).
seria(контакт,0).

seria(убийство_на_улице_Морг,0).
seria(приключения_Шерлока_Холмса,1).
seria(снеговик,0).
seria(хладнокровное_убийство,0).
seria(исчезнувшая,0).

seria(оно,0).
seria(дракула_Брэма,0).
seria(сборник_лучших_произведений_Г_Ф_Лавкрафта,1).
seria(призрак_дома_на_холме,0).
seria(изгоняющий_дьявола,0).

data(xроники_Черного_Отряда,1).
data(властели_Колец,1).
data(игра_престолов,1).
data(имя_ветра,0).
data(принц_Терний,0).

data(нейромант,1).
data(контакт,1).
data(мечтают_ли_андроиды_об_электроовцаx,2).
data(космическая_одиссея,2).
data(игра_Эндера,1).

data(убийство_на_улице_Морг,3).
data(приключения_Шерлока_Холмса,3).
data(снеговик,0).
data(хладнокровное_убийство,2).
data(исчезнувшая,0).

data(оно,1).
data(дракула_Брэма,3).
data(сборник_лучших_произведений_Г_Ф_Лавкрафта,3).
data(призрак_дома_на_холме,3).
data(изгоняющий_дьявола,2).

cinema(xроники_Черного_Отряда,0).
cinema(властели_Колец,1).
cinema(игра_престолов,1).
cinema(имя_ветра,0).
cinema(принц_Терний,0).

cinema(нейромант,0).
cinema(контакт,0).
cinema(мечтают_ли_андроиды_об_электроовцаx,1).
cinema(космическая_одиссея,1).
cinema(игра_Эндера,1).

cinema(убийство_на_улице_Морг,1).
cinema(приключения_Шерлока_Холмса,1).
cinema(снеговик,1).
cinema(хладнокровное_убийство,2).
cinema(исчезнувшая,1).

cinema(оно,1).
cinema(дракула_Брэма,1).
cinema(сборник_лучших_произведений_Г_Ф_Лавкрафта,0).
cinema(призрак_дома_на_холме,1).
cinema(изгоняющий_дьявола,1).
